{
  "heading": "Комплексные сценарии применения useRef",
  "chapter": "5.15",
  "input_data": "useRef позволяет хранить изменяемые значения без перерендера и управлять ссылками на DOM-узлы. В задаче необходимо реализовать архитектуру, где ref используется для оптимизации и контроля за поведением компонентов.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Реализовать компонент FocusableInput, который автоматически устанавливает фокус на поле ввода при монтировании, а также предоставляет наружу метод focus через forwardRef.",
        "Реализовать компонент StopWatch, который использует useRef для хранения времени старта и идентификатора setInterval. Компонент должен уметь запускаться, останавливаться и сбрасываться. Перерендер должен происходить только при обновлении отображаемого времени.",
        "Создать компонент ScrollToSection, который содержит длинный список и несколько маркеров секций. С помощью useRef и кнопок реализовать прокрутку к конкретному DOM-элементу.",
        "Создать компонент ParentDashboard, который объединяет FocusableInput, StopWatch и ScrollToSection. Организовать так, чтобы кнопка в ParentDashboard могла вызвать метод focus() у FocusableInput через ref.",
        "Добавить логирование в консоль: при каждом монтировании, размонтировании и изменении активных состояний компонентов выводить текущее состояние ref-объектов."
      ]
    }
  ],
  "expected_result": "Определены компоненты, которые используют useRef для хранения изменяемых данных, управления DOM-узлами и передачи методов наружу через forwardRef. Организована интеграция компонентов в ParentDashboard с управлением из родителя.",
  "objectives": [
    "Закрепление навыков работы с ref для доступа к DOM-элементам.",
    "Формирование навыка использования useRef для хранения изменяемых данных вне рендера.",
    "Освоение передачи методов наружу через forwardRef.",
    "Развитие умений объединять несколько компонентов, использующих ref, в одной архитектуре.",
    "Отработка практики логирования состояния ref при разных фазах жизненного цикла."
  ]
}
