{
  "heading": "DOM: анализ реальных и ложных сущностей",
  "chapter": "2.5",
  "input_data": "Представлен список узлов и методов. Часть из них реально существует в DOM, часть является вымышленными. Необходимо определить, какие сущности относятся к DOM, а какие нет, и обосновать выбор.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Определить, какие узлы из списка относятся к реальным узлам DOM, а какие являются вымышленными. Для каждого узла указать назначение или аргументировать, почему он ложный.",
        "Определить, какие методы и свойства относятся к DOM API, а какие вымышлены. Объяснить различие.",
        "Составить таблицу наследования интерфейсов для объектов: document, элемента h1 и текстового узла. Указать, какие методы и свойства реально доступны каждому из них.",
        "Привести пример кода, использующий не менее трёх реальных методов из списка.",
        {
          "type": "code",
          "title": "Пример изменения DOM",
          "code": "const ul = document.querySelector('ul');\nconst li = document.createElement('li');\nli.textContent = 'Новый элемент';\nul.appendChild(li);\ndocument.body.removeChild(document.querySelector('script'));"
        },
        "Продемонстрировать, как этот код изменяет DOM-дерево.",
        "Объяснить, в чём разница между свойствами childNodes и children, а также между атрибутами и свойствами DOM-элементов.",
        "Описать критерии, по которым можно отличить метод DOM API от стороннего или вымышленного метода."
      ]
    },
    {
      "type": "array",
      "title": "Список узлов (реальные и ложные)",
      "array": [
        "document",
        "Element",
        "Text",
        "Comment",
        "DocumentType",
        "DocumentFragment",
        "Node",
        "EventTarget",
        "Attribute",
        "HTMLCollection",
        "VirtualNode",
        "ShadowFragment",
        "GhostElement"
      ]
    },
    {
      "type": "array",
      "title": "Список методов и свойств (реальные и ложные)",
      "array": [
        "querySelector",
        "querySelectorAll",
        "getElementById",
        "getElementsByClassName",
        "getElementsByTagName",
        "appendChild",
        "removeChild",
        "replaceNode",
        "createElement",
        "createTextNode",
        "setAttributeNode",
        "detachNode",
        "childNodes",
        "children",
        "previousSibling",
        "nextSibling",
        "nodeType",
        "classList",
        "superQuery",
        "cloneFragment"
      ]
    }
  ],
  "expected_result": "Необходимо выделить реальные узлы и методы DOM, объяснить назначение существующих сущностей, аргументировать отсутствие вымышленных, продемонстрировать понимание наследования интерфейсов, отличий между свойствами и атрибутами, а также привести примеры кода. Результат должен содержать как классификацию, так и объяснения.",
  "objectives": [
    "Закрепить знание основных узлов DOM и их предназначения.",
    "Научиться классифицировать методы и свойства DOM, отличать реальные от вымышленных.",
    "Понять различия между childNodes и children, а также между атрибутами и свойствами.",
    "Разобраться в цепочках наследования интерфейсов и доступных методах.",
    "Развить навык критического анализа и проверки информации в документации.",
    "Закрепить практические навыки работы с DOM через написание примеров кода."
  ]
}
