{
  "heading": "Проектирование клиентского приложения корпоративного портала StaffFlow (3RApp)",
  "chapter": "8.1",
  "input_data": "Корпоративный портал StaffFlow предназначен для сотрудников компании и объединяет несколько направлений работы — задачи, отпуска, новости и профиль пользователя. Интерфейс портала строится на основе принципов модульного проектирования. Каждый экран должен быть реализован как самостоятельная страница с собственными бизнес-компонентами и общим лэйаутом. Ниже приведён концептуальный дизайн портала, на основе которого требуется определить архитектуру компонентов.",
  "problem": [
    {
      "type": "image",
      "title": "Дизайн корпоративного портала StaffFlow (концептуальная структура интерфейса)",
      "name": "design",
      "folder": "1",
      "chapter": "8.1",
      "format": "png"
    },
    {
      "type": "array",
      "title": "Описание основных экранов портала",
      "array": [
        "Рабочий стол (Dashboard) — сводка задач, новостей и уведомлений. Верхняя панель содержит приветствие и краткую статистику. Центральная область делится на блоки: «Мои задачи», «Новости».",
        "Раздел задач (Tasks) — отображает список текущих задач, возможность фильтрации и детального просмотра. При выборе задачи справа открывается карточка TaskDetails.",
        "Раздел отпусков (Vacations) — содержит форму подачи заявки и список ранее созданных запросов. Заявка оформляется в форме справа.",
        "Профиль пользователя (Profile) — отображает персональные данные, возможность изменения пароля и фото профиля.",
        "Экран аутентификации (Login) — минимальный интерфейс с формой логина и паролем. После успешного входа пользователь перенаправляется на рабочий стол. Ссылки на регистрацию нет, так как корпоративный портал."
      ]
    },
    "Техническое задание!",
    "- Вам необходимо описать модель будущего клиентского приложения StaffFlow, которая будет соответствовать дизайну (концептуальной структуре интерфейса или можно назвать это прототипом).",
    "- Откройте в книге на страницах 370 - 392 полное описание процедуры проектирования и начните использовать его для создания решения.",
    "- Обратите внимание, что здесь не заданы эндпоинты, откуда вам нужно получать данные для новостей, задач, профиля и логина и пароля. Это усложняет задачу, но повышает вашу компонентность реализации приложений. Вам нужно будет продумать эндпоинты самостоятельно, а именно имя сущности, url, метод, чтобы задать таблицу маппинга эндпоинтов на компоненты.",
    "- После создания решения, посмотрите в ответах, как может выглядеть решение созданное другим человеком. Ваша версия с большой вероятностью будет отличаться по именованию компонентов, по детализации деления на компоненты, состоянию приложения, именам свойств состояния и в другом и это абсолютно нормально, так как при проектировании 3RApp вам нужно учитывать многие моменты, а не один какой-то конкретный, который делается по шаблону не допускающему отклонений."
  ],
  "expected_result": "Создана модель фронтенд-приложения, в которой каждая часть интерфейса назначена конкретному компоненту соответствующей роли. Определен DAG компонентов и при необходимости создана таблица с компонентами (с ролями страница и бизнес-компонент), взаимодействие с REST API, определено глобальное состояние приложения и заданы пути, по которым будут рендериться конкретные компоненты (обычно это страницы).",
  "objectives": [
    "Развить навыки проектирования структуры приложения на основе визуального дизайна.",
    "Освоить принципы выделения компонентов по функциональным ролям.",
    "Научиться выстраивать иерархию компонентов 3RApp для корпоративных систем.",
    "Закрепить подход к созданию масштабируемой архитектуры."
  ]
}
