{
  "heading": "Разработка комплексного кастомного хука",
  "chapter": "5.17",
  "input_data": "Кастомные хуки используются для переиспользования логики и оптимизации кода. В задаче необходимо реализовать кастомный хук, который объединяет несколько задач: загрузку данных, мемоизацию вычислений, управление состоянием и взаимодействие с контекстом.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Создать контекст DataContext, предоставляющий базовый URL API.",
        "Реализовать кастомный хук useApiData(endpoint), который выполняет следующие действия:",
        "— использует useContext для получения базового URL из DataContext;",
        "— выполняет асинхронный запрос к API и сохраняет данные в состоянии с помощью useReducer;",
        "— использует useRef для хранения признака активного запроса, чтобы избегать обновления состояния после размонтирования;",
        "— использует useCallback для мемоизации функции refetch(), позволяющей повторно выполнить запрос вручную;",
        "— использует useMemo для вычисления производных данных (например, количество элементов или агрегированные значения) на основе загруженных данных;",
        "Создать компонент Dashboard, который использует DataContext.Provider, вызывает useApiData('/users') и отображает:",
        "— количество элементов из вычисленных данных;",
        "— список пользователей;",
        "— кнопку для вызова refetch().",
        "Добавить обработку ошибок и вывод состояния загрузки."
      ]
    }
  ],
  "expected_result": "Реализован кастомный хук useApiData, который комбинирует работу нескольких хуков React. Хук используется в Dashboard, обеспечивает повторную загрузку данных, корректно очищает эффекты и демонстрирует работу с производными данными.",
  "objectives": [
    "Закрепление навыка создания кастомных хуков с использованием нескольких встроенных хуков.",
    "Формирование умения объединять асинхронную логику, мемоизацию и управление состоянием.",
    "Отработка приёмов использования useCallback и useMemo в составе кастомного хука.",
    "Закрепление навыка передачи данных из контекста внутрь кастомного хука.",
    "Формирование архитектурного подхода для переиспользования логики."
  ]
}
