{
  "heading": "Реализация компонента DashboardPage по методологии реализации 3RApp",
  "chapter": "8.3",
  "input_data": "В корпоративном портале StaffFlow компонент DashboardPage является основной страницей рабочего стола пользователя. На ней отображаются сводные данные по ключевым направлениям: активные задачи, корпоративные новости, краткая статистика профиля. Необходимо реализовать компонент DashboardPage в соответствии с методологией, описанной в проверочном списке для реализации кода React-компонента, описанному в книге в разделе 8.3.9 на страницах 412 - 425. Реализация должна учитывать использование React, React Router и Redux Toolkit (в том числе RTK Query), а также Web API (про который часто забывают).",
  "problem": [
     "Это практическое задание выполняется на основе предыдущего практического задания 8.1, где вы выделили компоненты разных ролей из дизайна, задали маппинг компонентов на эндпоинты. Именно при реализации вам и понадобятся эти артефакты.",
    {
      "type": "array",
      "title": "Задание на реализацию компонента DashboardPage",
      "array": [
        "Определить назначение и функциональность компонента DashboardPage.",
        "Составить перечень подкомпонентов, которые используются внутри (бизнес-компоненты и интерфейсные элементы).",
        "Определить источники данных и способы их получения (через RTK Query или через fetch или с использованием ReactRouter).",
        "Реализовать глобальное состояние и подключение провайдеров, если компонент требует данные из общего стора.",
        "Добавить использование useState и useEffect для локального состояния и побочных эффектов, если необходимо.",
        "Определить структуру JSX с учетом логических блоков и секций панели (статистика, задачи, новости).",
        "Реализовать отображение загрузки и обработку ошибок.",
        "Использовать условный рендеринг для случаев, когда данные отсутствуют.",
        "Визуально разделить компонент на секции и оформить читаемую структуру JSX.",
        "Добавить документацию в виде комментариев к каждому логическому блоку кода."
      ]
    },
    "Следующие компоненты были предложены в качестве решения к 8.1 в ответах, поэтому там вы можете увидеть их более подробное описание.",
    {
      "type": "array",
      "title": "Ожидаемые бизнес-компоненты",
      "array": [
        "Statistic — общие показатели активности.",
        "TaskList — выводит список активных задач (до 5 последних).",
        "TaskDetails — показывает подробную информацию о выбранной задаче.",
        "NewsFeed — показывает несколько последних корпоративных новостей."
      ]
    }
  ],
  "expected_result": "Реализованный компонент DashboardPage, содержащий необходимый JSX. Компонент демонстрирует структуру и подход к построению кода по этапам, изложенным в чек-листе проектирования компонентов. Обратите внимание! Реализация должна быть произведена в строгом соответствии c: 1) последовательностью предлагаемой в подразделе 8.3.2 книги и 2) последовательностью, описанной в проверочном списке для реализации кода React-компонента. Это указывает на то, что компоненты уровня бизнес-компоненты к этому моменту ещё не реализованы.",
  "objectives": [
    "Закрепить навык построения компонента на основе пошагового проектирования.",
    "Освоить принципы интеграции RTK Query и локального состояния в одном компоненте.",
    "Научиться использовать модульную композицию и условный рендеринг.",
    "Отработать единообразие структуры и документирования React-компонентов."
  ]
}
