{
  "heading": "Анализ событий и управление их распространением",
  "chapter": "Раздел 9. События",
  "input_data": "События в браузере могут инициироваться пользователем, системой или программным кодом. Они проходят несколько стадий (захват, цель, всплытие) и обрабатываются с помощью слушателей. В задаче требуется проанализировать предложенные ситуации, классифицировать события и объяснить поведение кода.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Классифицировать события из списка по типам: пользовательские (UI), системные (браузера/устройства), программные (созданные вручную).",
        "Для каждого события определить объект-источник (document, window, элемент DOM, браузерное API и т.д.).",
        "Составить дерево распространения для события клика по кнопке, находящейся внутри div, который вложен в body.",
        "Объяснить, какие обработчики сработают и в каком порядке, если для body и div установлены слушатели на фазу захвата, а для кнопки — на фазу всплытия.",
        "Пояснить последствия использования stopPropagation() и stopImmediatePropagation() в разных точках цепочки.",
        "Привести примеры кода: корректное использование addEventListener и removeEventListener, демонстрация всплытия и захвата, создание кастомного события и его распространение.",
        "Проанализировать приведённые примеры кода и объяснить их поведение."
      ]
    },
    {
      "type": "array",
      "title": "Список событий",
      "array": [
        "click по элементу",
        "keydown на клавиатуре",
        "resize окна",
        "orientationchange (смена ориентации экрана)",
        "beforeunload",
        "readystatechange",
        "customEvent (созданный вручную через new Event())",
        "hoverstart (несуществующее событие)",
        "formsubmit",
        "visibilitychange"
      ]
    },
    {
      "type": "code",
      "title": "Пример 1: удаление обработчика",
      "code": "element.addEventListener('click', () => console.log('Клик'));\nelement.removeEventListener('click', () => console.log('Клик'));"
    },
    {
      "type": "code",
      "title": "Пример 2: использование stopPropagation",
      "code": "document.body.addEventListener('click', () => console.log('body'));\nconst div = document.querySelector('div');\ndiv.addEventListener('click', (e) => {\n  e.stopPropagation();\n  console.log('div');\n});\nconst btn = document.querySelector('button');\nbtn.addEventListener('click', () => console.log('button'));"
    }
  ],
  "expected_result": "Классификация событий, определение источников, построение дерева распространения, объяснение порядка вызова слушателей, анализ работы методов остановки распространения, корректные примеры кода и разбор поведения приведённых примеров.",
  "objectives": [
    "Развить умение классифицировать события по источникам и типам.",
    "Закрепить знания о фазах захвата, цели и всплытия.",
    "Научиться анализировать порядок вызова обработчиков и работу методов управления событием.",
    "Освоить корректное использование слушателей и удаление обработчиков.",
    "Закрепить понимание механизма остановки всплытия событий."
  ]
}
