{
  "heading": "Продвинутое использование useReducer для комплексного управления состоянием",
  "chapter": "5.14",
  "input_data": "Хук useReducer применяется для управления состоянием, когда логика его обновления сложная или состоит из нескольких взаимосвязанных частей. В задаче требуется реализовать приложение с составным состоянием, несколькими экшенами и использованием функции-инициализатора.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Создать редьюсер, который управляет составным состоянием вида { tasks: [], filter: 'all', stats: { completed: 0, pending: 0 } }. Логика должна включать обработку экшенов: ADD_TASK, TOGGLE_TASK, REMOVE_TASK, SET_FILTER.",
        "При добавлении задачи учитывать, что в состояние попадает объект { id, title, completed }. Идентификатор генерируется динамически.",
        "При переключении задачи (TOGGLE_TASK) должно обновляться не только свойство задачи completed, но и поле stats в состоянии.",
        "При удалении задачи обновлять массив и статистику.",
        "Реализовать использование функции-инициализатора init(initialArg), которая на основе массива строк создаёт массив задач и корректные stats.",
        "Создать компонент TaskManager, в котором используется useReducer с вышеописанным редьюсером. В нём реализовать добавление задачи через форму, вывод списка задач с возможностью удаления и переключения, а также выбор фильтра (all, completed, pending).",
        "Организовать фильтрацию списка задач в зависимости от выбранного filter.",
        "В консоли отследить порядок вызовов dispatch и обновления состояния для разных экшенов."
      ]
    }
  ],
  "expected_result": "Определён редьюсер со сложной логикой. Реализовано управление задачами и статистикой, фильтрация отображения инициализирована функцией init. В интерфейсе доступны добавление, переключение и удаление задач, а также переключение фильтров.",
  "objectives": [
    "Закрепление навыка работы с составным состоянием и несколькими экшенами.",
    "Формирование умения обновлять вложенные структуры состояния в редьюсере.",
    "Освоение применения функции init для инициализации состояния.",
    "Закрепление архитектурных приёмов вынесения редьюсера за пределы компонента.",
    "Анализ порядка вызова dispatch и перерендеров."
  ]
}
