{
  "heading": "Конфигурация маршрутов с вложенностью и динамическими сегментами (каталог фильмов)",
  "chapter": "6.4",
  "input_data": "Требуется реализовать маршрутизацию для веб-приложения каталога фильмов. Необходимо поддержать вложенные маршруты для отображения списка фильмов, детальной информации о фильме и просмотра отдельных сцен. Каждый уровень маршрутов должен отражать собственную область данных и интерфейса, а параметры маршрутов должны извлекаться динамически.",
  "problem": [
    {
      "type": "array",
      "title": "Требования к маршрутам",
      "array": [
        "Корневой маршрут '/' должен отображать компонент Layout с навигацией и Outlet.",
        "Путь '/movies' должен отображать компонент MoviePage, содержащий список фильмов и Outlet для вложенных маршрутов.",
        "Вложенный маршрут '/movies/:movieId' должен отображать компонент MovieDetails, который показывает информацию о фильме и ссылки на сцены.",
        "Следующий уровень '/movies/:movieId/:sceneId' должен отображать компонент MovieScene, получающий параметры movieId и sceneId через useParams.",
        "Для несоответствующих адресов должен отображаться компонент NotFoundPage.",
        "Архитектура проекта должна разделять Page-компоненты и бизнес-компоненты в разные каталоги (src/pages и src/business)."
      ]
    },
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Создать структуру маршрутов с тремя уровнями вложенности, используя createBrowserRouter.",
        "Реализовать компоненты Layout, MoviePage, MovieDetails, MovieScene и NotFoundPage.",
        "Реализовать навигацию по маршрутам при помощи Link и NavLink.",
        "Обеспечить извлечение параметров из URL через useParams.",
        "Организовать файловую структуру проекта согласно разделению по ролям компонентов."
      ]
    }
  ],
  "expected_result": "Реализована маршрутизация с динамическими сегментами для каталога фильмов, где при переходе по пути '/movies/interstellar/2' отображается информация о второй сцене фильма 'Interstellar'.",
  "objectives": [
    "Освоить создание вложенных маршрутов и управление их иерархией через Outlet.",
    "Закрепить работу с динамическими сегментами и хуком useParams.",
    "Научиться проектировать маршруты, отражающие структуру бизнес-сущностей.",
    "Отработать разделение логики между страницами и бизнес-компонентами."
  ]
}
