{
  "heading": "Использование useEffect для работы со сторонними API и управления жизненным циклом",
  "chapter": "5.7",
  "input_data": "useEffect применяется для синхронизации компонента со сторонними API, работы с платформенными функциями и управления ресурсами. В задаче требуется реализовать несколько компонентов, которые используют useEffect с разными зависимостями и демонстрируют очистку ресурсов.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Реализовать компонент DataFetcher, который получает данные с сервера (https://jsonplaceholder.typicode.com/users/) при изменении свойства userId. Запрос должен отменяться, если новое значение userId установлено до получения ответа (использовать AbortController).",
        "Реализовать компонент Timer, который запускает счётчик секунд с помощью setInterval в useEffect. При размонтировании компонента интервал должен очищаться.",
        "Реализовать компонент WindowSizeTracker, который подписывается на событие resize окна. При изменении размеров выводить текущую ширину и высоту. Подписка должна удаляться при размонтировании.",
        "Создать компонент Dashboard, который объединяет DataFetcher, Timer и WindowSizeTracker. Для DataFetcher передавать динамически изменяемый userId.",
        "Добавить консольные логи в каждый компонент для анализа порядка вызова функций рендера и useEffect."
      ]
    }
  ],
  "expected_result": "Компоненты должны корректно управлять побочными эффектами, очищать ресурсы при изменениях зависимостей или размонтировании и отображать обновлённые данные. В консоли должен быть виден порядок вызовов рендера и хуков useEffect.",
  "objectives": [
    "Формирование навыка управления жизненным циклом компонентов с помощью useEffect.",
    "Закрепление работы с AbortController для отмены запросов.",
    "Отработка подписки и отписки от событий браузера.",
    "Закрепление приёмов управления интервалами и таймерами.",
    "Анализ последовательности вызова функций рендера и эффектов."
  ]
}
