{
  "heading": "Рефакторинг структуры проекта с распределением компонентов по ролям",
  "chapter": "7.1",
  "input_data": "Существующее React-приложение содержит все компоненты в одной папке src/components. Такое расположение мешает быстро ориентироваться в проекте. Необходимо переименовать компоненты в соответствии с их ролью и распределить файлы по папкам согласно двум принципам: 1) компоненты группируются по ролям, 2) все остальные элементы (хуки, функции, стили, изображения) располагаются на том уровне, где они используются чаще всего.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "В приложении имеются компоненты: DataContext, App, MainLayout, Profile, ProductList, ProductCard, Button, Input.",
        "Определить к какой роли относится каждый компонент.",
        "Переименовать компоненты, если их имена не отражают их роль. Подсказка, компонент Profile — соответствует роли 'Страница'.",
        "Создать папки в src по ролям компонентов: provider, layout, pages, business, components.",
        "Разместить каждый компонент в соответствующей папке по его роли.",
        "В бизнес-компонентах используется общий хук useFetchData. Разместите хук в соответствующей папке согласно материалов книги."
      ]
    },
    {
      "type": "array",
      "title": "Подсказки",
      "array": [
        "Название файла должно совпадать с именем экспортируемого компонента.",
        "Если элемент используется в нескольких ролях, перенесите его на уровень src.",
        "Стили для каждого компонента можно хранить рядом с ним, например ProductCard.css.",
        "Не создавайте лишнюю вложенность — роль важнее иерархии."
      ]
    }
  ],
  "expected_result": "После выполнения рефакторинга структура файлов приложения станет отражать роли компонентов и принципы их взаимосвязей. Найти любой элемент проекта можно будет по его функциональной роли, а не по месту вызова.",
  "objectives": [
    "Освоить распределение компонентов по ролям приложения.",
    "Научиться организовывать файлы в соответствии с принципами логической структуры.",
    "Развить навык чтения и понимания архитектурных ролей компонентов.",
    "Повысить читаемость и управляемость кода проекта."
  ]
}
