{
  "heading": "Сложная архитектура с использованием нескольких контекстов",
  "chapter": "Раздел 39. Контекст и useContext",
  "input_data": "Контекст в React применяется для передачи данных на любом уровне дерева без использования prop drilling. Он может содержать не только значения, но и функции для обратной связи. В данной задаче необходимо реализовать приложение с несколькими контекстами, где состояние изменяется как родительскими, так и дочерними компонентами.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Создать два контекста: ThemeContext для управления темой (светлая/тёмная) и UserContext для управления текущим пользователем.",
        "Реализовать компонент RootProvider, который объединяет оба контекста и управляет состояниями: текущая тема и текущий пользователь. В UserContext передать не только данные пользователя, но и функцию обновления профиля.",
        "Реализовать компонент Header, который получает имя пользователя и текущую тему из контекстов и отображает приветствие с учётом темы.",
        "Реализовать компонент ThemeSwitcher, который меняет тему приложения при клике и обновляет значение ThemeContext.",
        "Реализовать компонент UserProfileEditor, который получает функцию обновления пользователя из контекста и позволяет изменять имя пользователя через форму.",
        "Реализовать компонент Dashboard, который объединяет Header, ThemeSwitcher и UserProfileEditor. При изменении темы должен обновляться стиль интерфейса, при изменении пользователя должно обновляться приветствие в Header."
      ]
    }
  ],
  "expected_result": "Реализовано приложение с двумя независимыми контекстами. ThemeContext управляет темой интерфейса, UserContext управляет состоянием пользователя и предоставляет функцию обновления. Обеспечена обратная связь: изменения из дочерних компонентов влияют на состояние родителя и отображаются в других компонентах.",
  "objectives": [
    "Освоение использования нескольких контекстов одновременно.",
    "Закрепление передачи функций обратной связи через контекст.",
    "Формирование навыка динамического обновления контекста дочерними компонентами.",
    "Понимание архитектурных преимуществ контекста над prop drilling."
  ]
}
