{
  "heading": "Создание единого лэйаута с изменением содержимого для разных страниц",
  "chapter": "6.7",
  "input_data": "Требуется реализовать простое React-приложение с маршрутизацией и одним общим лэйаутом. Этот лэйаут должен изменять часть интерфейса (например, заголовок или панель навигации) в зависимости от того, на какой странице находится пользователь. В приложении должно быть как минимум две страницы: Главная и О проекте.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Создать общий лэйаут AppLayout, в котором отображаются: шапка с заголовком, панель навигации и область для рендеринга дочерних страниц (Outlet).",
        "Реализовать изменение заголовка внутри AppLayout в зависимости от активного маршрута — например, если открыт путь /about, заголовок должен быть 'О проекте', а если /, то 'Главная страница'.",
        "Создать две страницы: HomePage и AboutPage, которые выводят различный контент.",
        "Настроить маршрутизацию с помощью createBrowserRouter, чтобы обе страницы рендерились внутри общего лэйаута.",
        "Добавить простую навигацию между страницами с помощью NavLink.",
        "Создать компонент NotFoundPage для обработки неверных адресов."
      ]
    },
    {
      "type": "array",
      "title": "Подсказки",
      "array": [
        "Для определения текущего пути используйте хук useLocation из react-router-dom.",
        "Outlet используется для отображения дочернего маршрута внутри лэйаута.",
        "NavLink автоматически применяет активный класс для текущего маршрута.",
        "Лэйаут должен быть размещён в src/layout/AppLayout.jsx, а страницы — в src/pages."
      ]
    }
  ],
  "expected_result": "Приложение с единым лэйаутом, который динамически изменяет заголовок при переходе между страницами. При переходе между / и /about пользователю видно, как интерфейс адаптируется под контекст каждой страницы.",
  "objectives": [
    "Освоить базовые принципы построения общего лэйаута в React.",
    "Научиться использовать хук useLocation для динамических изменений в интерфейсе.",
    "Закрепить практику работы с Outlet и NavLink в React Router.",
    "Понять, как общий лэйаут помогает сохранять единый стиль интерфейса при смене страниц."
  ]
}
