{
  "heading": "Использование GigaChat для генерации сложного React-компонента (KanbanBoard) с оптимистичными обновлениями",
  "chapter": "8.6",
  "input_data": "Требуется спроектировать и реализовать компонент KanbanBoard для корпоративного портала. Компонент должен: 1) получать данные колонок и задач из RTK Query; 2) поддерживать перетаскивание карточек между колонками (drag & drop) с HTML5 DnD; 3) выполнять оптимистичные обновления порядка задач с откатом при ошибке; 4) обеспечивать базовую доступность (ARIA роли, фокус, клавиатурные подсказки). Разрешено использовать GigaChat для генерации первоначального кода и его поэтапного улучшения через уточняющие промпты.",
  "problem": [
    {
      "type": "array",
      "title": "Технические требования к компоненту",
      "array": [
        "Компонент размещается в src/pages/KanbanBoard.jsx и использует данные из src/store/api/boardApi.js.",
        "Структура данных: { columns: [{ id, title, taskIds: string[] }], tasks: { [taskId]: { id, title, assignee } } }.",
        "HTML5 Drag&Drop: карточки перетаскиваются между колонками; при отпускании выполняется оптимистичное обновление, далее — мутация reorder; при ошибке — откат локального состояния.",
        "Доступность: у списков role='list', у карточек role='listitem' и aria-grabbed; видимая индикация фокуса и падение границ при dragover.",
        "Производительность: мемоизация карточек (React.memo) и ключи по id."
      ]
    },
    {
      "type": "array",
      "title": "Промпты к GigaChat (этапы уточнения)",
      "array": [
        "Промпт 1 (скелет): Создай React-компонент KanbanBoard, который получает из RTK Query структуру { columns, tasks }, рендерит колонки со списками карточек и поддерживает перенос карточек между колонками через HTML5 Drag&Drop. Добавь обработчик onDrop для смены колонки.",
        "Промпт 2 (данные и оптимизм): Дополни компонент использованием createApi из Redux Toolkit Query: запрос getBoard (GET /api/v1/board) и мутация reorder (POST /api/v1/board/reorder). Реализуй оптимистичное обновление через onQueryStarted и updateQueryData с откатом при ошибке.",
        "Промпт 3 (доступность): Добавь ARIA роли: role='list' для колонок, role='listitem' и aria-grabbed для карточек. Добавь фокусируемость карточек tabIndex={0} и стиль фокуса. Для колонок добавь визуальную подсветку при dragover.",
        "Промпт 4 (рефакторинг): Вынеси карточку в отдельный компонент TaskCard (React.memo). Обеспечь корректные ключи элементов, обработку пустых списков и устойчивость к отсутствию данных."
      ]
    }
  ],
  "expected_result": "Рабочий компонент KanbanBoard, который получает данные через RTK Query, поддерживает перенос задач между колонками с оптимистичными обновлениями и базовой доступностью. В решении должны быть приведены итоговые файлы компонента, API-слайса и карточки.",
  "objectives": [
    "Отработать промпт-инжиниринг для поэтапной генерации кода в GigaChat.",
    "Закрепить практику оптимистичных обновлений в RTK Query с откатом состояния.",
    "Реализовать HTML5 Drag&Drop и базовую доступность для списков и элементов.",
    "Структурировать код на уровне страниц и бизнес-компонентов с мемоизацией."
  ]
}
