{
  "heading": "Продвинутая композиция компонентов в React",
  "chapter": "5.8",
  "input_data": "Компоненты React могут объединяться разными способами: через свойство children, динамический вывод с использованием массива и метода map, передачу JSX как слота и передачу компонентов по ссылке. В задаче требуется реализовать комбинированный сценарий с применением всех этих подходов.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Реализовать компонент Container, который использует свойство children и добавляет к каждому дочернему элементу дополнительный div с классом wrapper.",
        "Реализовать компонент DynamicList, принимающий массив объектов формата { id, title, content } и выводящий для каждого объекта отдельный элемент списка с использованием map. Каждый элемент списка должен использовать свойство key.",
        "Создать компонент LayoutPage, который принимает через свойства header и footer JSX-элементы и выводит их вверху и внизу страницы. Между ними должен отображаться контейнер с children.",
        "Создать компонент Dashboard, который принимает компоненты Header и Footer по ссылке (например, HeaderComponent и FooterComponent), использует LayoutPage, а также включает внутри DynamicList с набором элементов и Container с вложенными компонентами.",
        "Организовать отображение так, чтобы одновременно были задействованы все четыре техники: children, map, слот JSX и передача компонентов по ссылке."
      ]
    }
  ],
  "expected_result": "Создана структура интерфейса, в которой используются различные приёмы объединения компонентов. Должно быть продемонстрировано применение children для вложенных элементов, массива и метода map для динамического вывода, слотов для передачи JSX и передачи компонентов по ссылке для LayoutPage.",
  "objectives": [
    "Закрепление работы со свойством children.",
    "Формирование навыка динамического вывода элементов массива с использованием map и key.",
    "Освоение приёма передачи JSX через слот в свойствах.",
    "Закрепление техники передачи компонентов по ссылке.",
    "Формирование целостного понимания продвинутой композиции компонентов."
  ]
}
