{
  "heading": "Сложные сценарии обработки событий в React",
  "chapter": "5.9",
  "input_data": "События в React назначаются на элементы с помощью атрибутов on*. При этом обработчики получают объект события React с доступом к свойствам target, currentTarget и методам, таким как preventDefault. В задаче требуется реализовать несколько компонентов, демонстрирующих комплексную обработку событий, в том числе комбинированных и назначаемых на объекты вне дерева React.",
  "problem": [
    {
      "type": "array",
      "title": "Задания",
      "array": [
        "Реализовать компонент FormHandler, который содержит поля email и password. Каждое поле должно иметь собственный обработчик события onChange. Реализовать поведение формы: при отправке (onSubmit) предотвращать действие по умолчанию и выводить значения в консоль.",
        "Реализовать компонент LinkBlocker, который отображает список ссылок. Обработчик onClick должен предотвращать переход по адресу и выводить в консоль URL нажатой ссылки, используя свойства target и currentTarget.",
        "Реализовать компонент MouseTracker, который одновременно использует onMouseMove и onClick на одном элементе. Обработчики должны сохранять координаты курсора и количество кликов в состоянии и отображать их на экране.",
        "Реализовать компонент GlobalResizeTracker, который использует useEffect для назначения обработчика события resize на объект window (вне React). При изменении размеров окна отображать ширину и высоту.",
        "Создать компонент Dashboard, который объединяет все вышеперечисленные компоненты. Реализовать вывод в консоль логов при вызове обработчиков для анализа последовательности их работы."
      ]
    }
  ],
  "expected_result": "Определены компоненты, в которых реализована обработка событий на элементах React и на объектах DOM вне дерева компонентов. Демонстрируется использование target, currentTarget, метода preventDefault, множественных обработчиков на одном элементе и обработчиков вне React.",
  "objectives": [
    "Закрепление навыка назначения обработчиков на элементы JSX.",
    "Отработка работы с объектом события React: target, currentTarget, preventDefault.",
    "Формирование навыка комбинирования нескольких обработчиков на одном элементе.",
    "Закрепление практики работы с событиями вне React через window и useEffect.",
    "Анализ последовательности работы обработчиков и их взаимодействия."
  ]
}
